-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- ホスト: localhost
-- 生成日時: 2023 年 2 月 01 日 23:46
-- サーバのバージョン： 5.7.38-log
-- PHP のバージョン: 8.2.0RC2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `laravel`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `nounyusakis`
--

CREATE TABLE `nounyusakis` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `koujyou_id` bigint(20) UNSIGNED NOT NULL,
  `meisyou` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `kana` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `hyouji` tinyint(1) NOT NULL DEFAULT '1',
  `narabikae` int(11) DEFAULT NULL,
  `bikou` text COLLATE utf8mb4_unicode_ci,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- テーブルのデータのダンプ `nounyusakis`
--

INSERT INTO `nounyusakis` (`id`, `koujyou_id`, `meisyou`, `kana`, `hyouji`, `narabikae`, `bikou`, `updated_at`, `created_at`) VALUES
(1, 1, '三井住建道路㈱', 'ミツイスミケンドウロ', 1, 38, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(2, 1, '個人', 'コジン', 1, 9, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(3, 2, '個人', 'コジン', 1, 10, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(4, 1, '㈱藤井組', 'フジイグミ', 1, 32, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(5, 1, '㈱雨森組', 'アマモリグミ', 1, 1, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(6, 1, '荒井建設㈱', 'アライケンセツ', 1, 3, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(7, 1, '㈱生駒組', 'イコマグミ', 1, 5, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(8, 1, '㈲神造船建設', 'ジンゾウセンケンセツ', 1, 11, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(9, 1, '㈲ツツミ', 'ツツミ', 1, 16, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(10, 1, '㈲七尾工務店', 'ナナオコウムテン', 1, 23, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(11, 1, '㈱廣野組', 'ヒロノグミ', 1, 29, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(12, 1, '橋本建設工業㈱', 'ハシモトケンセツコウギョウ', 1, 25, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(13, 1, '㈱堀口組', 'ホリグチグミ', 1, 36, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(14, 1, '㈱吉安組', 'ヨシヤスグミ', 1, 45, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(15, 1, '㈱早坂組', 'ハヤサカグミ', 1, 27, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(16, 1, '㈱吉田産業', 'ヨシダサンギョウ', 1, 43, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(17, 1, '利尻電業㈱', 'リシリデンギョウ', 1, 47, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(18, 1, '星田建設', 'ホシダケンセツ', 1, 34, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(19, 1, '山本建設', 'ヤマモトケンセツ', 1, 40, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(20, 1, '大成工業', 'タイセイコウギョウ', 1, 14, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(21, 1, '亀田建設', 'カメダケンセツ', 1, 7, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(22, 2, '㈱藤井組', 'フジイグミ', 1, 33, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(23, 2, '㈱雨森組', 'アマモリグミ', 1, 2, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(24, 2, '荒井建設㈱', 'アライケンセツ', 1, 4, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(25, 2, '㈱生駒組', 'イコマグミ', 1, 6, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(26, 2, '㈲神造船建設', 'ジンゾウセンケンセツ', 1, 12, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(27, 2, '㈲ツツミ', 'ツツミ', 1, 17, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(28, 2, '㈲七尾工務店', 'ナナオコウムテン', 1, 24, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(29, 2, '㈱廣野組', 'ヒロノグミ', 1, 30, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(30, 2, '橋本建設工業㈱', 'ハシモトケンセツコウギョウ', 1, 26, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(31, 2, '㈱堀口組', 'ホリグチグミ', 1, 37, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(32, 2, '㈱吉安組', 'ヨシヤスグミ', 1, 46, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(33, 2, '㈱早坂組', 'ハヤサカグミ', 1, 28, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(34, 2, '㈱吉田産業', 'ヨシダサンギョウ', 1, 44, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(35, 2, '利尻電業㈱', 'リシリデンギョウ', 1, 48, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(36, 2, '星田建設', 'ホシダケンセツ', 1, 35, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(37, 2, '山本建設', 'ヤマモトケンセツ', 1, 41, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(38, 2, '大成工業', 'タイセイコウギョウ', 1, 15, '', '2022-10-23 06:47:20', '2022-10-23 06:47:20'),
(39, 2, '亀田建設', 'カメダケンセツ', 1, 8, '', '2022-10-23 06:47:21', '2022-10-23 06:47:21'),
(40, 2, '三井住建道路㈱', 'ミツイスミケンドウロ', 1, 39, '', '2022-10-23 06:47:21', '2022-10-23 06:47:21'),
(41, 2, '㈱中田組', 'ナカタグミ', 1, 22, '', '2022-10-23 06:47:21', '2022-10-23 06:47:21'),
(42, 1, '㈱中田組', 'ナカタグミ', 1, 21, '', '2022-10-23 06:47:21', '2022-10-23 06:47:21'),
(43, 1, '藤・石塚経常建設JV', 'フジ・イシヅカケイジョウケンセツJV', 1, 31, '', '2022-10-23 06:47:21', '2022-10-23 06:47:21'),
(44, 1, '中田・荒井JV', 'ナカタ・アライJV', 1, 18, '', '2022-10-23 06:47:21', '2022-10-23 06:47:21'),
(45, 1, '中田・ササキJV', 'ナカタ・ササキJV', 1, 19, '', '2022-10-23 06:47:21', '2022-10-23 06:47:21'),
(46, 2, '中田・ササキJV', 'ナカタ・ササキJV', 1, 20, '', '2022-10-23 06:47:21', '2022-10-23 06:47:21'),
(47, 1, '菅原喜夫', 'スガワラヨシオ', 1, 13, '', '2022-10-23 06:47:21', '2022-10-23 06:47:21'),
(48, 2, '稚内港湾施設㈱', 'ワッカナイコウワンシセツ', 1, 49, '', '2022-10-23 06:47:21', '2022-10-23 06:47:21'),
(49, 2, '山本隆夫', 'ヤマモトタカオ', 1, 42, '', '2022-10-23 06:47:21', '2022-10-23 06:47:21');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `nounyusakis`
--
ALTER TABLE `nounyusakis`
  ADD PRIMARY KEY (`id`),
  ADD KEY `nounyusakis_koujyou_id_foreign` (`koujyou_id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `nounyusakis`
--
ALTER TABLE `nounyusakis`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=50;

--
-- ダンプしたテーブルの制約
--

--
-- テーブルの制約 `nounyusakis`
--
ALTER TABLE `nounyusakis`
  ADD CONSTRAINT `nounyusakis_koujyou_id_foreign` FOREIGN KEY (`koujyou_id`) REFERENCES `koujyous` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
